// Character JSON changes

{
  "wisdom toad": {
    "location": "trail",
    "desc": "Your path is blocked by a big, fat toad eating a sandwich.  He offers you a backpack, saying it's convenient.",
    "dialog":
    "This backpack might be helpful if you find anything that you can't eat."

  },
  "triton": {
    "location": "empty plot",
    "desc": "You see a tire-looking turtle.  Don't worry about him eating you, he's gluten-free and frogs make him feel bloated.",
    "dialog":
    "I can't stress enough how much I genuinely don't want to eat you.  You're slimy and gross."
  },
  "buckley": {
    "location": "wetland",
    "desc": "You see a majestic stag sloshing around in the mud.  He looks lost...",
    "dialog":
    "Oh thank goodness, could you go get help for me?  I'm lost and I'm pretty sure you couldn't get me out of this mud"
  },
  "sting": {
    "location": "grasslands",
    "desc": "You encounter a sneaky scorpion.  This story sounds familiar, but you can't put your webbed finger on it.",
    "dialog":
    "Look, I'll be honest... I'm just here to eat smaller frogs.  They're delicious."
  },
  "dawei": {
    "location": "pond",
    "desc": "There's another tadpole over there.  They eye you off.  How rude!",
    "dialog":
    "I don't know how you expect me to take you seriously when you're so pink."
  },
  "tallulah": {
    "location": "swamp",
    "desc": "You see a glorious giraffe, queen among herbivores.",
    "dialog":
    "Hey there, shorty!  It looks like there's a lake to the East, but you can't get there from here."
  },
  "violet": {
    "location": "dock",
    "desc": "You witness the move beautiful frog in the world.  It's love at first sight and you know you're meant for each other.",
    "dialog":
    "I know this sounds crazy, but don't you think we're a perfect match?  You're a frog... I'm a frog...it makes sense!"
  },
  "destiny": {
    "location": "dock",
    "desc": "You croak at a local frog and she doesn't even give you the time of day.  You're used to it, but it still hurts a little.",
    "dialog":
    "I don't think we'd be a good match.  We're both aquarius, but you're honestly gross."
  },
  "karen": {
    "location": "dock",
    "desc": "A generally unpleasant frog with very poor manners and a warped sense of reality.",
    "dialog":
    "This is unacceptable.  I want to see your manager."
  },
  "trevin": {
    "location": "lake",
    "desc": "You see a frog swimming in circles and crying a lot.  You COULD reach out...",
    "dialog":
    "I can't seem to find the dock and some gross old toad told me that's where I can find a mate!"
  }
}